! Iw[.m]   表示以w个字符宽度输出 整数 ，至少输出m个数字
! Fw.d     表示以w个字符宽度输出 浮点数，小数部分占d个字符宽
! Ew.d[Ee] 科学计算法，以w个字符宽度输出 浮点数，小数部分占d个字符宽，指数部分最少输出e个数字 
! Dw.d     使用方法同 Ew.d ,差别在于输出时代表指数的字母由 E 换成 D
! Aw       表示以w个字符宽度输出 字符串
! nX       输出位置向右移动n位
! /        换行输出
program ex0421
  integer   a
  real      b
  complex   c
  logical   d
  character(len=20) e
  a=10
  b=12.34
  c=(1,2)
  d=.true.
  e="FORTRAN"
  write(*,"(1X,I5)")    a  ! 用I来格式化整数
  write(*,"(1X,F5.2)" ) b  ! 用F来格式化浮点数
  write(*,"(1X,F4.1,F4.1)" ) c ! complex也是浮点数
  write(*,"(1X,L3)") d  ! 用L来输出logical
  write(*,"(1X,A10)") e ! 用A来输出字符串

  write(*,"(I5)") 100    !输出 100(前面补2空格)
  write(*,"(I3)") 10000  !输出 ***
  write(*,"(I5.3)") 10   !输出 010(前面补2空格)
  write(*,"(F9.3)") 123.45 !输出 123.450(前面补2空格)
  write(*,"(E15.7)") 123.45!输出0.1234500E+03(前面补2空格)
  write(*,"(E9.2E3)") 12.34!输出0.12E002(前面补1空格)
  write(*,"(A10)") "Hello"   !输出Hello(前面补5空格)

  write(*,"(A3)") "Hello"    !输出Hel
  write(*,"(5X,I3)") 100     !先输出5空格，在输出整数
  write(*,"(I3//F4.1)") 123, 45.1 !中间空2行

  write(*,"(3(1XF5.2))") 1.00, 2.00, 3.00  ! 重复格式
  write(*,"('3+4=',I1)") 3+4  !输出3+4=7
end


